---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
source: html/12e3944c-0c43-8c08-d3d0-15828d9a6337.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintedEventArgs

The event arguments used by the DocumentPrinted event.

## Syntax (C#)
```csharp
public class DocumentPrintedEventArgs : RevitAPIPostDocEventArgs
```